Revit 2027 API
Application.OpenIFCDocument Method
Overload List
Name | Description
OpenIFCDocument(String) |  Opens an IFC document from disk using default options.
OpenIFCDocument(String, IFCImportOptions) |  Opens an IFC document from disk using custom options.
Top
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace